**What is Pandas?**
-


Pandas is a Python library used for working with data sets.

It has functions for analyzing, cleaning, exploring, and manipulating data.

The name "Pandas" has a reference to both "Panel Data", and "Python Data Analysis" and was created by Wes McKinney in 2008.

In [2]:
import pandas as pd

mydataset = {
  'cars': ["BMW", "Volvo", "Ford"],
  'passings': [3, 7, 2]
}

myvar = pd.DataFrame(mydataset)

print(myvar)

    cars  passings
0    BMW         3
1  Volvo         7
2   Ford         2

In [5]:
dict1 = {
    'name': ['harry', 'rohan', 'skillf'],
    'marks': [92, 34, 24],
    'city': ['rampur', 'kolkata', 'antartica']
}

df = pd.DataFrame(dict1)
print(df)

     name  marks       city
0   harry     92     rampur
1   rohan     34    kolkata
2  skillf     24  antartica

**Dataframe Converting into CSV**
-

In [8]:
df.to_csv('first_csv_File_with_Index.csv')

**Without Index in Converting Dictionary to CSV file**

In [ ]:
df.to_csv('first_csv_File_with_.csv',index=False)

In [9]:
df

     name  marks       city
0   harry     92     rampur
1   rohan     34    kolkata
2  skillf     24  antartica